1358484518/stm32h5f4tfm/trusted-firmware-m/platform/ext/target/stm/common/hal/CMSIS_Driver/low_level_flash.c
static int32_t Flash_Initialize(ARM_Flash_SignalEvent_t cb_event)
{
#ifdef DEBUG_FLASH_ACCESS
  FLASH_OperationTypeDef flash_operation;
#endif
  ARG_UNUSED(cb_event);

#ifdef DEBUG_FLASH_ACCESS
  HAL_FLASHEx_GetOperation(&flash_operation);
  printf("Flash operation: Op=0x%x, Area=0x%x, Address=0x%x",
               flash_operation.OperationType,
               flash_operation.FlashArea,
               flash_operation.Address);
#endif
  FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);
  return ARM_DRIVER_OK;
}

static int32_t Flash_Uninitialize(void)
{
  return ARM_DRIVER_OK;
}

static int32_t Flash_PowerControl(ARM_POWER_STATE state)
{
  switch (state)
  {
    case ARM_POWER_FULL:
      /* Nothing to be done */
      return ARM_DRIVER_OK;
    case ARM_POWER_OFF:
    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
    default:
      return ARM_DRIVER_ERROR_PARAMETER;
  }
}

static int32_t Flash_ReadData(uint32_t addr, void *data, uint32_t cnt)
{
  int32_t ret = ARM_DRIVER_ERROR_SPECIFIC;
  bool is_valid = true;

  /* Conversion between data items and bytes */
  cnt *= data_width_byte[DriverCapabilities.data_width];
  ARM_FLASH0_STATUS.error = DRIVER_STATUS_NO_ERROR;

  /* Check Flash memory boundaries */
  is_valid = is_range_valid(&ARM_FLASH0_DEV, addr + cnt - 1);
  if (is_valid != true)
  {
    if (ARM_FLASH0_DEV.dev->read_error)
    {
      ARM_FLASH0_STATUS.error = DRIVER_STATUS_ERROR;
      return ARM_DRIVER_ERROR_PARAMETER;
    }
    memset(data, 0xff, cnt);
    return ARM_DRIVER_OK;
  }
  /*  ECC to implement with NMI */
  /*  do a memcpy */
#ifdef DEBUG_FLASH_ACCESS
  printf("read %lx n=%x \r\n", (addr + FLASH_BASE), cnt);
#endif /*  DEBUG_FLASH_ACCESS */
  DoubleECC_Error_Counter = 0U;

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* area secure and non secure are done with a non secure access */
  if (is_range_secure(&ARM_FLASH0_DEV, addr, cnt))
  {
#ifdef TFM_DEV_MODE
    if (addr >= FLASH_B_SIZE) {
      static uint8_t bank2_s_logged;
      if (!bank2_s_logged) {
        bank2_s_logged = 1;
        printf("BL2 bank2 read S alias 0x%x\r\n", (unsigned)(addr + FLASH_BASE));
      }
    }
#endif
    memcpy_flash(data, (void *)((uint32_t)addr + FLASH_BASE), cnt);
  }
  else
  {
#ifdef TFM_DEV_MODE
    if (addr >= FLASH_B_SIZE) {
      static uint8_t bank2_ns_logged;
      if (!bank2_ns_logged) {
        bank2_ns_logged = 1;
        printf("BL2 bank2 read NS alias 0x%x\r\n", (unsigned)(addr + FLASH_BASE_NS));
      }
    }
#endif
    memcpy_flash(data, (void *)((uint32_t)addr + FLASH_BASE_NS), cnt);
  }
#else
  memcpy_flash(data, (void *)((uint32_t)addr + FLASH_BASE_NS), cnt);
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
  if (DoubleECC_Error_Counter == 0U)
  {
    ret = ARM_DRIVER_OK;
  }
  else
  {
    /* Return OK with data = 0, when double ECC error */
#ifdef DEBUG_FLASH_ACCESS
    printf("Double ECC error detected: FLASH_ECCR=0x%x", FLASH->ECCR);
#endif
    memset(data, 0x00, cnt);
    ret = ARM_DRIVER_OK;
  }
  DoubleECC_Error_Counter = 0U;
  if (ret == ARM_DRIVER_OK) {
    cnt /= data_width_byte[DriverCapabilities.data_width];
    return cnt;
  } else {
    return ret;
  }
}

#ifdef TFM_ICACHE_ENABLE
#define HAL_ICACHE_MODULE_ENABLED
static int stm32_icache_disable(void)
{
  int status = 0;
  uint32_t tickstart;

  /* Clear BSYENDF flag first and then disable the instruction cache
   * that starts a cache invalidation procedure
   */
  CLEAR_BIT(ICACHE->FCR, ICACHE_FCR_CBSYENDF);

  HAL_ICACHE_Disable();

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait for instruction cache to get disabled */
  while (HAL_ICACHE_IsEnabled()) {
    if ((HAL_GetTick() - tickstart) >
            ICACHE_DISABLE_TIMEOUT_VALUE) {
      /* New check to avoid false timeout detection in case
       * of preemption.
       */
      if (HAL_ICACHE_IsEnabled()) {
        status = ARM_DRIVER_ERROR_TIMEOUT;
        break;
      }
    }
  }

  return status;
}

static void stm32_icache_enable(void)
{
  HAL_ICACHE_Enable();
}

static int icache_wait_for_invalidate_complete(void)
{
  int status = ARM_DRIVER_ERROR;
  uint32_t tickstart;

  /* Check if ongoing invalidation operation */
  if (__HAL_ICACHE_GET_FLAG(ICACHE_FLAG_BUSY)) {
    /* Get tick */
    tickstart = HAL_GetTick();

    /* Wait for end of cache invalidation */
    while (!__HAL_ICACHE_GET_FLAG(ICACHE_FLAG_BUSYEND)) {
      if ((HAL_GetTick() - tickstart) >
          ICACHE_INVALIDATE_TIMEOUT_VALUE) {
        break;
      }
    }
  }

  /* Clear any pending flags */
  if (__HAL_ICACHE_GET_FLAG(ICACHE_FLAG_BUSYEND)) {
    __HAL_ICACHE_CLEAR_FLAG(ICACHE_FLAG_BUSYEND);
    status = 0;
  } else {
    status = ARM_DRIVER_ERROR_TIMEOUT;
  }

  if (__HAL_ICACHE_GET_FLAG(ICACHE_FLAG_ERROR)) {
    __HAL_ICACHE_CLEAR_FLAG(ICACHE_FLAG_ERROR);
    status = ARM_DRIVER_ERROR;
  }

  return status;
}
#endif // TFM_ICACHE_ENABLE

static int32_t Flash_ProgramData(uint32_t addr,
                                 const void *data, uint32_t cnt)
{
  uint32_t loop = 0;
  uint32_t flash_base = (uint32_t)FLASH_BASE;
#if FLASH0_PROG_UNIT == 0x8
  uint32_t write_type = FLASH_TYPEPROGRAM_DOUBLEWORD;
#elif FLASH0_PROG_UNIT == 0x10
  uint32_t write_type = FLASH_TYPEPROGRAM_QUADWORD;
#else
#error "flash configuration must be defined here"
#endif /* FLASH0_PROG_UNIT */
  HAL_StatusTypeDef err;
#if defined(CHECK_WRITE) || defined(DEBUG_FLASH_ACCESS)
  void *dest;
#endif
  /* Conversion between data items and bytes */
  cnt *= data_width_byte[DriverCapabilities.data_width];
  ARM_FLASH0_STATUS.error = DRIVER_STATUS_NO_ERROR;
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (is_range_secure(&ARM_FLASH0_DEV, addr, cnt))
  {
    flash_base = (uint32_t)FLASH_BASE_S;
#if FLASH0_PROG_UNIT == 0x8
    write_type = FLASH_TYPEPROGRAM_DOUBLEWORD;
#elif FLASH0_PROG_UNIT == 0x10
    write_type = FLASH_TYPEPROGRAM_QUADWORD;
#else
#error "flash configuration must be defined here"
#endif /* FLASH0_PROG_UNIT */
  }
  else
  {
    flash_base = (uint32_t)FLASH_BASE_NS;
#if FLASH0_PROG_UNIT == 0x8
    write_type = FLASH_TYPEPROGRAM_DOUBLEWORD_NS;
#elif FLASH0_PROG_UNIT == 0x10
    write_type = FLASH_TYPEPROGRAM_QUADWORD_NS;
#else
#error "flash configuration must be defined here"
#endif
  }
#endif
#if defined(CHECK_WRITE) || defined(DEBUG_FLASH_ACCESS)
  dest = (void *)(flash_base + addr);
#endif
#ifdef DEBUG_FLASH_ACCESS
  printf("write %x n=%x \r\n", (uint32_t) dest, cnt);
#endif /* DEBUG_FLASH_ACCESS */
  /* Check Flash memory boundaries and alignment with minimum write size
    * (program_unit), data size also needs to be a multiple of program_unit.
  */
  if ((!is_range_valid(&ARM_FLASH0_DEV, addr + cnt - 1)) ||
      (!is_write_aligned(&ARM_FLASH0_DEV, addr))     ||
      (!is_write_aligned(&ARM_FLASH0_DEV, cnt))      ||
      (!is_write_allow(&ARM_FLASH0_DEV, addr, cnt))
     )
  {
    ARM_FLASH0_STATUS.error = DRIVER_STATUS_ERROR;
    return ARM_DRIVER_ERROR_PARAMETER;
  }

#ifdef TFM_ICACHE_ENABLE
  /* Disable icache, this will start the invalidation procedure.
    * All changes(erase/write) to flash memory should happen when
    * i-cache is disabled. A write to flash performed without
    * disabling i-cache will set ERRF error flag in SR register.
    */
  stm32_icache_disable();
#endif /* TFM_ICACHE_ENABLE */

  if (is_range_secure(&ARM_FLASH0_DEV, addr, cnt)) {
    HAL_FLASH_Unlock_SEC();
  } else {
    HAL_FLASH_Unlock_NS();
  }

  ARM_FLASH0_STATUS.busy = DRIVER_STATUS_BUSY;
  do
  {
#if FLASH0_PROG_UNIT == 0x8
    /* doubleword api*/
    uint32_t dword[2];
    memcpy(dword, (void *)((uint32_t)data + loop), sizeof(dword));
    if ((dword[0] != -1) || (dword[1] != -1))
    {
      err = HAL_FLASH_Program(write_type, (flash_base + addr), (uint32_t)&dword[0]);
    }
    else
	{
        err = HAL_OK;
	}
#elif FLASH0_PROG_UNIT == 0x10
    /* quadword api*/
    uint64_t dword[2];
    memcpy(dword, (void *)((uint32_t)data + loop), sizeof(dword));
    if ((dword[0] != -1) || (dword[1] != -1))
        err = HAL_FLASH_Program(write_type, (flash_base + addr), (uint32_t)&dword[0]);
    else
        err = HAL_OK;
#else
#error "flash configuration must be defined here"
#endif
    loop += sizeof(dword);
    addr += sizeof(dword);
  } while ((loop != cnt) && (err == HAL_OK));

  ARM_FLASH0_STATUS.busy = DRIVER_STATUS_IDLE;

  if (is_range_secure(&ARM_FLASH0_DEV, addr, cnt)) {
    HAL_FLASH_Lock_SEC();
  } else {
    HAL_FLASH_Lock_NS();
  }

#ifdef TFM_ICACHE_ENABLE
  icache_wait_for_invalidate_complete();

  /* I-cache should be enabled only after the
    * invalidation is complete.
    */
  stm32_icache_enable();
#endif /* TFM_ICACHE_ENABLE */

  /* compare data written */
#ifdef CHECK_WRITE
  if ((err == HAL_OK) && memcmp(dest, data, cnt))
  {
    err = HAL_ERROR;
#ifdef DEBUG_FLASH_ACCESS
    printf("write %x n=%x (cmp failed)\r\n", (uint32_t)(dest), cnt);
#endif /* DEBUG_FLASH_ACCESS */
  }
#endif /* CHECK_WRITE */
#ifdef DEBUG_FLASH_ACCESS
  if (err != HAL_OK)
  {
    printf("failed write %x n=%x \r\n", (uint32_t)(dest), cnt);
  }
#endif /* DEBUG_FLASH_ACCESS */
  cnt /= data_width_byte[DriverCapabilities.data_width];
  return (err == HAL_OK) ? cnt : ARM_DRIVER_ERROR;
}

