1358484518/stm32h5f4tfm/trusted-firmware-m/platform/ext/target/stm/common/hal/CMSIS_Driver/low_level_flash.c
static int32_t Flash_EraseSector(uint32_t addr)
{
  FLASH_EraseInitTypeDef EraseInit;
  HAL_StatusTypeDef err;
  uint32_t pageError;
#ifdef CHECK_ERASE
  uint32_t i;
  uint32_t *pt;
#endif /* CHECK_ERASE */
#ifdef DEBUG_FLASH_ACCESS
  printf("erase %x\r\n", addr);
#endif /* DEBUG_FLASH_ACCESS */
  if (!(is_range_valid(&ARM_FLASH0_DEV, addr)) ||
      !(is_erase_aligned(&ARM_FLASH0_DEV, addr)) ||
      !(is_erase_allow(&ARM_FLASH0_DEV, addr)))
  {
    ARM_FLASH0_STATUS.error = DRIVER_STATUS_ERROR;
#ifdef DEBUG_FLASH_ACCESS
#if defined(__ARMCC_VERSION)
    printf("failed erase %x\r\n", addr);
#else
    printf("failed erase %lx\r\n", addr);
#endif /* __ARMCC_VERSION */
#endif /* DEBUG_FLASH_ACCESS */
    return ARM_DRIVER_ERROR_PARAMETER;
  }
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (is_range_secure(&ARM_FLASH0_DEV, addr, 4))
  {
#if defined(FLASH_TYPEERASE_SECTORS)
    EraseInit.TypeErase = FLASH_TYPEERASE_SECTORS;
#else
    EraseInit.TypeErase = FLASH_TYPEERASE_PAGES;
#endif
  }
  else
#if defined(FLASH_TYPEERASE_SECTORS_NS)
    EraseInit.TypeErase = FLASH_TYPEERASE_SECTORS_NS;
#else
    EraseInit.TypeErase = FLASH_TYPEERASE_PAGES_NS;
#endif
#else
    EraseInit.TypeErase = FLASH_TYPEERASE_PAGES;
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
  /*  fix me assume dual bank, reading DBANK in OPTR in Flash init is better */
  /*  flash size in  DB256K in OPTR */
#if defined (FLASH_BANK_2)
  /*  fix me assume dual bank, reading DBANK in OPTR in Flash init is better */
  /*  flash size in  DB256K in OPTR */
  EraseInit.Banks = bank_number(&ARM_FLASH0_DEV, addr);
#endif /*FLASH_BANK_2*/

#if defined(FLASH_SECTOR_SIZE)
    EraseInit.NbSectors = FLASH0_SECTOR_SIZE / FLASH_SECTOR_SIZE;
#else
    EraseInit.NbPages = FLASH0_SECTOR_SIZE / FLASH_PAGE_SIZE;
#endif
#if defined(FLASH_SECTOR_SIZE)
    EraseInit.Sector = page_number(&ARM_FLASH0_DEV, addr);
#else
    EraseInit.Page = page_number(&ARM_FLASH0_DEV, addr);
#endif

#ifdef TFM_ICACHE_ENABLE
  /* Disable icache, this will start the invalidation procedure.
    * All changes(erase/write) to flash memory should happen when
    * i-cache is disabled. A write to flash performed without
    * disabling i-cache will set ERRF error flag in SR register.
    */
  stm32_icache_disable();
#endif /* TFM_ICACHE_ENABLE */

  ARM_FLASH0_STATUS.error = DRIVER_STATUS_NO_ERROR;
  if (is_range_secure(&ARM_FLASH0_DEV, addr, 4)) {
    HAL_FLASH_Unlock_SEC();
  } else {
    HAL_FLASH_Unlock_NS();
  }
  ARM_FLASH0_STATUS.busy = DRIVER_STATUS_BUSY;
  err = HAL_FLASHEx_Erase(&EraseInit, &pageError);
  ARM_FLASH0_STATUS.busy = DRIVER_STATUS_IDLE;
  if (is_range_secure(&ARM_FLASH0_DEV, addr, 4)) {
    HAL_FLASH_Lock_SEC();
  } else {
    HAL_FLASH_Lock_NS();
  }

#ifdef TFM_ICACHE_ENABLE
  icache_wait_for_invalidate_complete();

  /* I-cache should be enabled only after the
    * invalidation is complete.
    */
  stm32_icache_enable();
#endif /* TFM_ICACHE_ENABLE */

#ifdef DEBUG_FLASH_ACCESS
  if (err != HAL_OK)
  {
    printf("erase failed \r\n");
  }
#endif /* DEBUG_FLASH_ACCESS */
#ifdef CHECK_ERASE
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  if (is_range_secure(&ARM_FLASH0_DEV, addr, 4))
  {
    pt = (uint32_t *)((uint32_t)FLASH_BASE_S + addr);
  }
  else
  {
    pt = (uint32_t *)((uint32_t)FLASH_BASE_NS + addr);
  }
#else
  pt = (uint32_t *)((uint32_t)FLASH_BASE + addr);
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)  */
  for (i = 0; i > 0x400; i++)
  {
    if (pt[i] != 0xffffffff)
    {
#ifdef DEBUG_FLASH_ACCESS
      printf("erase failed off %x %x %x\r\n", addr, &pt[i], pt[i]);
#endif /* DEBUG_FLASH_ACCESS */
      err = HAL_ERROR;
      break;
    }
  }
#endif /* CHECK_ERASE */
  return (err == HAL_OK) ? ARM_DRIVER_OK : ARM_DRIVER_ERROR;
}

static int32_t Flash_EraseChip(void)
{
  return ARM_DRIVER_ERROR_UNSUPPORTED;
}

static ARM_FLASH_STATUS Flash_GetStatus(void)
{
  return ARM_FLASH0_STATUS;
}

static ARM_FLASH_INFO *Flash_GetInfo(void)
{
  return ARM_FLASH0_DEV.data;
}

ARM_DRIVER_FLASH TFM_Driver_FLASH0 =
{
  /* Get Version */
  Flash_GetVersion,
  /* Get Capability */
  Flash_GetCapabilities,
  /* Initialize */
  Flash_Initialize,
  /* UnInitialize */
  Flash_Uninitialize,
  /* power control */
  Flash_PowerControl,
  /* Read data */
  Flash_ReadData,
  /* Program data */
  Flash_ProgramData,
  /* Erase Sector */
  Flash_EraseSector,
  /* Erase chip */
  Flash_EraseChip,
  /* Get Status */
  Flash_GetStatus,
  /* Get Info */
  Flash_GetInfo
};
/**
  * @brief  Get Link Register value (LR)
  * @param  None.
  * @retval LR Register value
  */
__attribute__((always_inline)) __STATIC_INLINE uint32_t __get_LR(void)
{
  register uint32_t result;

#if defined ( __ICCARM__ ) || ( __GNUC__ )
  __ASM volatile("MOV %0, LR" : "=r"(result));
#elif defined ( __CC_ARM )
  __ASM volatile("MOV result, __return_address()");
#endif /* ( __ICCARM__ ) || ( __GNUC__ )  */

  return result;
}

/*
   As this handler code relies on stack pointer position to manipulate the PC return value, it is important
   not to use extra registers (on top of scratch registers), because it would change the stack pointer
   position. Then compiler optimizations are customized to ensure that.
*/

/*  to rework the define has changed with  ARMCLANG .... */
#if defined(__ARMCC_VERSION)
/*#pragma O0 */
#elif defined ( __GNUC__ )
/**/
#endif /*__ARMCC_VERSION */

#if defined (STM32H573xx)
void NMI_Handler(void)
{
  if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_ECCD))
  {
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ECCD);
    /* Memorize error to ignore the read value */
    DoubleECC_Error_Counter++;
  }
  else
  {
    /* This exception occurs for another reason than flash double ECC errors */
    while (1U);
  }
}
#else
void NMI_Handler(void)
{
  uint32_t *p_sp;
  uint32_t lr;
  uint16_t opcode_msb;
  if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_ECCD))
  {
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ECCD);
    /* Memorize error to ignore the read value */
    DoubleECC_Error_Counter++;

    lr = __get_LR();

    /* Check EXC_RETURN value in LR to know which SP was used prior entering exception */
    if (((lr) & (0xFU)) == 0xDU)
    {
      /* interrupted code was using Process Stack Pointer */
      p_sp = (uint32_t *)__get_PSP();
    }
    else
    {
      /* interrupted code was using Main Stack Pointer */
      p_sp = (uint32_t *)__get_MSP();
    }

    /* Test caller mode T bit from CPSR in stack */
    if ((*(p_sp + 7U) & (1U << xPSR_T_Pos)) != 0U)
    {
      /* Thumb  mode.
         Test PC in stack.
         If bits [15:11] of the halfword being decoded take any of the following values,
         the halfword is the first halfword of a 32-bit instruction: 0b11101, 0b11110, 0b11111.
         Otherwise, the halfword is a 16-bit instruction.
      */
      opcode_msb = (*(uint16_t *)(*(p_sp + 6) & 0xFFFFFFFEU) & 0xF800U);
      if ((opcode_msb == 0xE800U) || (opcode_msb == 0xF000U) || (opcode_msb == 0xF800U))
      {
        /* execute next instruction PC +4  */
        *(p_sp + 6U) += 4U;
      }
      else
      {
        /* execute next instruction PC +2  */
        *(p_sp + 6U) += 2U;
      }
    }
    else
    {
      /* ARM mode execute next instruction PC +4 */
      *(p_sp + 6U) += 4U;
    }
  }
  else
  {
    /* This exception occurs for another reason than flash double ECC errors */
    while (1U);
  }
}
#endif /* STM32H573xx */
